{"pageProps":{"markdown":{"content":"\n# Community Marketing & Communications Strategist\n\n[Acid.info](http://Acid.info) needs a community marketing and communications strategy wizard to join its Movement Building and Campaign Activation unit. The chosen applicant will be tasked with developing a clear, purpose-driven communications strategy for multiple teams under the wider organization’s umbrella. We’re looking for an inspiring, motivating, impactful and energetic individual to take the reigns and reflect these qualities and our political philosophy across all future communications. \n\nWe are building a grassroots movement to create technological alternatives to oppressive systems of societal control. Vehemently anti-censorship, anti-surveillance and anti-authoritarian, we support basic human rights via the creation of opt-in alternatives to traditional power structures.\n\nWorking alongside experienced activists, our dream candidate is one who firmly aligns with our political and philosophical ethos. We’re not looking for someone that is just “into crypto/web3” but an individual that lives and breathes cypherpunk ideals and shows a passion for disruption through unconventional means. \n\n### About Acid.info\n\n[Acid.info](http://Acid.info) is a creative design studio within Logos. It serves as the organization’s communications hub and is made up of designers, coders, linguists, dreamers and revolutionaries. The department takes a brutalist approach to the creation process, favoring impactful designs over superfluous detail that risks diluting or warping the overall message.  \n\n### About Logos\n\nLogos emerges from and builds upon the mission undertaken by Status. More overtly political than its predecessor, Logos creates digital infrastructure to emancipate those shut out of global society by oppressive governments, economic circumstances or Big Tech overreach. The collective’s long-term goal is the formation of a network state—a purpose-driven community living within an opt-in alternative system to that of the nation state.  \n\nTo learn more about Logos, consult this [handbook](https://github.com/acid-info/public-assets/blob/master/logos-manual.pdf). \n\nGot what it takes? Check the expanded [job description](https://grnh.se/bd98c8601us), apply and join us.\n","metadata":{"title":"Community Marketing & Communications Strategist"},"toc":[{"content":"Community Marketing & Communications Strategist","slug":"community-marketing-communications-strategist","lvl":1,"i":0,"seen":0},{"content":"About Acid.info","slug":"about-acid-info","lvl":3,"i":1,"seen":0},{"content":"About Logos","slug":"about-logos","lvl":3,"i":2,"seen":0}]},"navProps":{"metadata":{"published":true,"title":"Community Marketing & Communications Strategist"},"navOrder":-1,"localPath":"join-us/community-marketing-&-communications-strategist.md","path":["join-us","community-marketing-communications-strategist"],"children":[],"isDir":false},"routeParams":{"path":["join-us","community-marketing-communications-strategist"]}},"__N_SSG":true}