{"pageProps":{"markdown":{"content":"\n# Digital Communications Lead\n\n[Acid.info](http://Acid.info) needs a seasoned Digital Communications Lead to join its Movement Building and Campaign Activation unit. Derived from our political philosophy, the message you help formulate will be central to everything we do. If you’re a communications mage and natural storyteller, capable of delivering a complex narrative in the most impactful way, this could be the gig for you. \n\nWe are building a grassroots movement to create technological alternatives to oppressive systems of societal control. Vehemently anti-censorship, anti-surveillance and anti-authoritarian, we support basic human rights via the creation of opt-in alternatives to traditional power structures.\n\nWorking alongside experienced activists, our dream candidate is one who firmly aligns with our political and philosophical ethos. We’re not looking for someone that is just “into crypto/web3” but an individual that lives and breathes cypherpunk ideals and shows a passion for disruption through unconventional means. \n\n### Key responsibilities\n\n- Develop ideas and initial plans for an overall digital communications strategy that aligns with our overall movement building strategy and commercial communications priorities\n- Work proactively and productively with key [Acid.info](http://Acid.info) team members and other stakeholders to ensure the disciplined delivery of the digital communications plan\n- Take ownership of our social media channels\n- Assume day-to-day responsibility for all of our online channels\n\n### Ideal qualities\n\n- 7+ years experience in digital communications and marketing, including solid experience in web3/blockchain\n- Excellent written and verbal communications skills\n- Experience working for or with political, campaigning, civil society, human rights organizations or NGOs.\n- Deep experience in designing and delivering impactful digital communications campaigns validated by use of data and KPIs\n- Ability to monitor trends and identify creative opportunities that support campaign objectives\n- Demonstrable experience of successfully using social media for campaigning, mobilization, community engagement and/or fundraising\n- Good understanding of the political climate and developments in the privacy, data and digital rights, and blockchain space.\n- Ability to monitor and analyze performance data.\n- Excellent organizational skills with the ability to initiate, monitor, prioritise and complete projects\n- High degree of self-motivation and exceptional attention to detail\n- Able to work independently and as part of a team, under pressure, and meet tight deadlines\n- Commitment and willingness to learn and grow\n- A strong alignment with our [principles](https://status.im/about/#our-principles)\n\n### Bonus points\n\n- Bachelor's degree in marketing, business administration or a related field\n- Experience working remotely and asynchronously\n- Experience in blockchain and peer-to-peer technology\n- Experience working for an open-source organization or an organization aligned politically with Status\n- You identify with the cypherpunk movement\n\n### Compensation\n\n- Expected compensation ranges from `$70,000-$100,000` for this role—negotiable for the right candidate\n- Payment in any mix of fiat or crypto, with the option to choose the ratio of fiat to crypto on a monthly basis\n- A stake in our success via a Status Network Token bonus package\n\n### Working with us\n\n- All positions are remote with flexible working hours—we value quality and consistency over strict obedience to a traditional working day.\n- We operate an open vacation policy—there’s no hard limit on how much holiday you take.\n- We are driven by shared [principles](https://our.status.im/our-principles/) and believe in complete transparency. Everything we do is completely public to the entire community.\n- We are a small-but-expanding organization of 150+ core contributors scattered across more than 30 countries.\n- We provide a generous budget to equip your working space as needed for the role, and an allowance for coworking needs.\n\nLearn more about the perks and benefits of working with us [here](https://status.im/our_team/perks_benefits.html). \n\n### About Acid.info\n\n[Acid.info](http://Acid.info) is a creative design studio within Logos. It serves as the organization’s communications hub and is made up of designers, coders, linguists, dreamers and revolutionaries. The department takes a brutalist approach to the creation process, favoring impactful designs over superfluous detail that risks diluting or warping the overall message.  \n\n### About Logos\n\nLogos emerges from and builds upon the mission undertaken by Status. More overtly political than its predecessor, Logos creates digital infrastructure to emancipate those shut out of global society by oppressive governments, economic circumstances or Big Tech overreach. The collective’s long-term goal is the formation of a network state—a purpose-driven community living within an opt-in alternative system to that of the nation state.  \n\nTo learn more about Logos, consult this [handbook](https://github.com/acid-info/public-assets/blob/master/logos-manual.pdf). \n\nGot what it takes? [Apply today](https://grnh.se/74e626161us) and join us.\n","metadata":{"title":"Digital Communications Lead"},"toc":[{"content":"Digital Communications Lead","slug":"digital-communications-lead","lvl":1,"i":0,"seen":0},{"content":"Key responsibilities","slug":"key-responsibilities","lvl":3,"i":1,"seen":0},{"content":"Ideal qualities","slug":"ideal-qualities","lvl":3,"i":2,"seen":0},{"content":"Bonus points","slug":"bonus-points","lvl":3,"i":3,"seen":0},{"content":"Compensation","slug":"compensation","lvl":3,"i":4,"seen":0},{"content":"Working with us","slug":"working-with-us","lvl":3,"i":5,"seen":0},{"content":"About Acid.info","slug":"about-acid-info","lvl":3,"i":6,"seen":0},{"content":"About Logos","slug":"about-logos","lvl":3,"i":7,"seen":0}]},"navProps":{"metadata":{"published":true,"title":"Digital Communications Lead"},"navOrder":-1,"localPath":"join-us/digital-communications-lead.md","path":["join-us","digital-communications-lead"],"children":[],"isDir":false},"routeParams":{"path":["join-us","digital-communications-lead"]}},"__N_SSG":true}