{"pageProps":{"markdown":{"content":"# Senior UI/UX Designer (Web)\n\n[Acid.info](http://Acid.info) needs a web UI/UX design veteran to lead our team’s efforts as Status evolves into the Logos DAO. The chosen candidate will work closely with the studio lead and oversee all aspects of the design process—from R&D to prototyping and production. Alongside the skills to develop and maintain a state-of-the-art design system with diverse themes, the ability to manage the wider design team while creating a culture of collaboration and creativity is vital.\n\nLogos is a grassroots movement creating technological alternatives to oppressive systems of societal control. Vehemently anti-censorship, anti-surveillance and anti-authoritarian, we support basic human rights via the creation of opt-in alternatives to traditional power structures.\n\nWorking closely with experienced activists, our ideal candidate is one who firmly aligns with Logos’ political and philosophical ethos. We’re not looking for someone that is just “into crypto/web3” but an individual that lives and breathes cypherpunk ideals and shows a passion for disruption through unconventional means.\n\n### Key responsibilities:\n\n- Lead our team’s UI/UX design efforts\n- Design, document, maintain and develop our design systems (with input from other team members)\n- Take responsibility for design workflows\n- Help the studio lead define and foresee work packages, and ensure they’re delivered punctually\n\n### Ideal qualities:\n\n- Extensive knowledge of design tools for everything from UX to (micro) interactions (e.g., Figma, Framer)\n- Good knowledge and understanding of design systems, typography and layout design\n- Experience building products\n- Authenticity in design and the ability to resist design trends (especially trends in web3)—yet, be able to adopt those styles if needed\n- Experience collaborating with stakeholders to identify and design for user goals\n- A strong alignment with our [principles](https://status.im/about/#our-principles)\n\n### Bonus points:\n\n- Experience working with an open-source organization\n- Experience in designing publishing mediums such as online readers, zines, books and online publishing platforms\n- Experience in field computational design, generative art or memes\n\n### Compensation:\n\n- Payment in any mix of fiat or crypto, with the option to choose the ratio of fiat to crypto on a monthly basis\n- A stake in our success via a Status Network Token bonus package\n\n### Working with us:\n\n- All positions are remote with flexible working hours—we value quality and consistency over strict obedience to a traditional working day.\n- We operate an open vacation policy—there’s no hard limit on how much holiday you take.\n- We are driven by shared [principles](https://our.status.im/our-principles/) and believe in complete transparency. Everything we do is completely public to the entire community.\n- We are a small-but-expanding organization of 150+ core contributors scattered across more than 30 countries.\n- We provide a generous budget to equip your working space as needed for the role, and an allowance for coworking needs.\n\nLearn more about the perks and benefits of working with us [here](https://status.im/our_team/perks_benefits.html).\n\n### About Acid.info:\n\n[Acid.info](http://Acid.info) is a creative design studio within the Logos DAO. It serves as the organization’s communications hub and is made up of designers, coders, linguists, dreamers and revolutionaries. The department takes a brutalist approach to the creation process, favoring impactful designs over superfluous detail that risks diluting or warping the overall message.\n\n### About Logos:\n\nLogos emerges from and builds upon the mission undertaken by Status. More overtly political than its predecessor, Logos creates digital infrastructure to emancipate those shut out of global society by oppressive governments, economic circumstance or Big Tech overreach. The collective’s long-term goal is the formation of a network state—a purpose-driven community living within an opt-in alternative system to that of the nation state.\n\nTo learn more about Logos, consult this [handbook](https://github.com/acid-info/public-assets/blob/master/logos-manual.pdf).\n","metadata":{"title":"Senior UI/UX Designer"},"toc":[{"content":"Senior UI/UX Designer (Web)","slug":"senior-ui-ux-designer-web","lvl":1,"i":0,"seen":0},{"content":"Key responsibilities:","slug":"key-responsibilities","lvl":3,"i":1,"seen":0},{"content":"Ideal qualities:","slug":"ideal-qualities","lvl":3,"i":2,"seen":0},{"content":"Bonus points:","slug":"bonus-points","lvl":3,"i":3,"seen":0},{"content":"Compensation:","slug":"compensation","lvl":3,"i":4,"seen":0},{"content":"Working with us:","slug":"working-with-us","lvl":3,"i":5,"seen":0},{"content":"About Acid.info:","slug":"about-acid-info","lvl":3,"i":6,"seen":0},{"content":"About Logos:","slug":"about-logos","lvl":3,"i":7,"seen":0}]},"navProps":{"metadata":{"published":true,"title":"Senior UI/UX Designer"},"navOrder":-1,"localPath":"join-us/senior-ui-designer.md","path":["join-us","senior-ui-designer"],"children":[],"isDir":false},"routeParams":{"path":["join-us","senior-ui-designer"]}},"__N_SSG":true}