{"pageProps":{"markdown":{"content":"# Web Developer\n\n[Acid.info](http://Acid.info) needs an elite web developer to support the Logos DAO and take responsibility for the development and technical maintenance of various web-based projects. Working closely with the communications hub’s development team, studio lead and design team, our chosen candidate will make decisions on code architecture, conduct testing and select an optimum technology stack, as well as other related tasks.\n\nLogos is a grassroots movement creating technological alternatives to oppressive systems of societal control. Vehemently anti-censorship, anti-surveillance and anti-authoritarian, we support basic human rights via the creation of opt-in alternatives to traditional power structures.\n\nWorking alongside experienced activists, our dream hire is one who firmly aligns with Logos’ political and philosophical ethos. We’re not looking for someone that is just “into crypto/web3” but an individual that lives and breathes cypherpunk ideals and shows a passion for disruption through unconventional means.\n\n### Key responsibilities:\n\n- Develop and implement internal tools, including our Wiki engine framework and Branding Design Portal—our design system implementation in React\n- Co-author documentation for relevant products/projects\n- Take responsibility for maintaining our open-sourced codebases on GitHub\n- Improve the architecture and implementation of our [current site-generator framework](https://github.com/acid-info/logos-site-builder) (built on top of Next.js) and develop it\n\n### Ideal qualities:\n\n- Experience in React.js and Node.js (all in TypeScript)\n- Good understanding of software architecture\n- Experience in the implementation of frontend libraries and design systems\n- Experience working with Git, Docker and Next.js framework as well as Vercel and/or Netlify\n- A strong alignment with our [principles](https://www.notion.so/Status-im-Homepage-Analytics-7d0fd46eb769460982e17c1808877215)\n\n### Bonus points:\n\n- Experience working with an open-source organization\n- Comfortable working remotely and asynchronously\n- Familiar with creative coding (processing, open frameworks, WebGL, writing shaders, p5js)\n\n### Compensation:\n\n- Payment in any mix of fiat or crypto, with the option to choose the ratio of fiat to crypto on a monthly basis\n- A stake in our success via a Status Network Token bonus package\n\n### Working with us:\n\n- All positions are remote with flexible working hours—we value quality and consistency over strict obedience to a traditional working day.\n- We operate an open vacation policy—there’s no hard limit on how much holiday you take.\n- We are driven by shared [principles](https://our.status.im/our-principles/) and believe in complete transparency. Everything we do is completely public to the entire community.\n- We are a small-but-expanding organization of 150+ core contributors scattered across more than 30 countries.\n- We provide a generous budget to equip your working space as needed for the role, and an allowance for coworking needs.\n\nLearn more about the perks and benefits of working with us [here](https://status.im/our_team/perks_benefits.html).\n\n### About Acid.info:\n\n[Acid.info](http://Acid.info) is a creative design studio within the Logos DAO. It serves as the organization’s communications hub and is made up of designers, coders, linguists, dreamers and revolutionaries. The department takes a brutalist approach to the creation process, favoring impactful designs over superfluous detail that risks diluting or warping the overall message.\n\n### About Logos:\n\nLogos emerges from and builds upon the mission undertaken by Status. More overtly political than its predecessor, Logos creates digital infrastructure to emancipate those shut out of global society by oppressive governments, economic circumstance or Big Tech overreach. The collective’s long-term goal is the formation of a network state—a purpose-driven community living within an opt-in alternative system to that of the nation state.\n\nTo learn more about Logos, consult this [handbook](https://github.com/acid-info/public-assets/blob/master/logos-manual.pdf).\n","metadata":{"title":"Web Developer","category":"jobs"},"toc":[{"content":"Web Developer","slug":"web-developer","lvl":1,"i":0,"seen":0},{"content":"Key responsibilities:","slug":"key-responsibilities","lvl":3,"i":1,"seen":0},{"content":"Ideal qualities:","slug":"ideal-qualities","lvl":3,"i":2,"seen":0},{"content":"Bonus points:","slug":"bonus-points","lvl":3,"i":3,"seen":0},{"content":"Compensation:","slug":"compensation","lvl":3,"i":4,"seen":0},{"content":"Working with us:","slug":"working-with-us","lvl":3,"i":5,"seen":0},{"content":"About Acid.info:","slug":"about-acid-info","lvl":3,"i":6,"seen":0},{"content":"About Logos:","slug":"about-logos","lvl":3,"i":7,"seen":0}]},"navProps":{"metadata":{"published":true,"title":"Web Developer","category":"jobs"},"navOrder":-1,"localPath":"join-us/web-developer.md","path":["join-us","web-developer"],"children":[],"isDir":false},"routeParams":{"path":["join-us","web-developer"]}},"__N_SSG":true}