{"pageProps":{"markdown":{"content":"\n# Grassroots Community Organizer\n\n[Acid.info](http://Acid.info) is eager to bring a passionate, driven grassroots community organizer onboard to steer our political movement-building operations. Our ideal candidate will nurture our fledgling community of volunteers, core contributors and activists as we embark on our mission to rebuild humanity’s future with liberation-geared, people-powered software.\n\nWe’re building a grassroots movement to create technological alternatives to oppressive systems of societal control. Vehemently anti-censorship, anti-surveillance and anti-authoritarian, we support basic human rights via the creation of opt-in alternatives to traditional power structures.\n\nWorking alongside experienced activists, our dream candidate is one who firmly aligns with our political and philosophical ethos. We’re not looking for someone that is just “into crypto/web3” but an individual that lives and breathes cypherpunk ideals and shows a passion for disruption through unconventional means. \n\n### Key responsibilities\n\n- Contribute to the design and delivery of our comprehensive, action-orientated plan of grassroots campaigning activities to create and empower thriving online communities\n- Day-to-day responsibility for community and movement building, and grassroots campaigning activities\n- Ensure that our grassroots volunteers, activists and community members are engaged, active and empowered to proactively participate in various initiatives aimed at contributing to the organization’s overall goals and objectives\n\n### Ideal qualities\n\n- Excellent written and verbal communications skills\n- Experience working for or with political, campaigning, civil society or human rights organizations or NGOs as a community organizer or community manager\n- Proven track record of working with activist communities on strategy, and creating and building sustainable campaigns\n- Proven track record designing and implementing grassroots community initiatives aimed at bringing about change\n- Experience successfully scaling up community building and grassroots campaigning operations and activities\n- Understanding of the political climate and developments in the privacy, data and digital rights, and the blockchain space\n- Comfortable working remotely and asynchronously\n- A strong alignment with our [principles](https://status.im/about/#our-principles)\n\n### Bonus points\n\n- Experience in blockchain or peer-to-peer technology\n- Experience working with web3 grassroots communities\n- Experience working for an open-source organization or an organization aligned politically with Status\n- You identify with the Cypherpunk movement\n\n### Compensation\n\n- Payment in any mix of fiat or crypto, with the option to choose the ratio of fiat to crypto on a monthly basis\n- A stake in our success via a Status Network Token bonus package\n\n### Working with us\n\n- All positions are remote with flexible working hours—we value quality and consistency over strict obedience to a traditional working day.\n- We operate an open vacation policy—there’s no hard limit on how much holiday you take.\n- We are driven by shared [principles](https://our.status.im/our-principles/) and believe in complete transparency. Everything we do is completely public to the entire community.\n- We are a small-but-expanding organization of 150+ core contributors scattered across more than 30 countries.\n- We provide a generous budget to equip your working space as needed for the role, and an allowance for coworking needs.\n\nLearn more about the perks and benefits of working with us [here](https://status.im/our_team/perks_benefits.html). \n\n### About Acid.info\n\n[Acid.info](http://Acid.info) is a creative design studio within the Logos DAO. It serves as the organization’s communications hub and is made up of designers, coders, linguists, dreamers and revolutionaries. The department takes a brutalist approach to the creation process, favoring impactful designs over superfluous detail that risks diluting or warping the overall message.  \n\n### About Logos\n\nLogos emerges from and builds upon the mission undertaken by Status. More overtly political than its predecessor, Logos creates digital infrastructure to emancipate those shut out of global society by oppressive governments, economic circumstances or Big Tech overreach. The collective’s long-term goal is the formation of a network state—a purpose-driven community living within an opt-in alternative system to that of the nation state.  \n\nTo learn more about Logos, consult this [handbook](https://github.com/acid-info/public-assets/blob/master/logos-manual.pdf). \n\nGot what it takes? [Apply today](https://grnh.se/faafa9311us) and join us.","metadata":{"title":"Grassroots Community Organizer"},"toc":[{"content":"Grassroots Community Organizer","slug":"grassroots-community-organizer","lvl":1,"i":0,"seen":0},{"content":"Key responsibilities","slug":"key-responsibilities","lvl":3,"i":1,"seen":0},{"content":"Ideal qualities","slug":"ideal-qualities","lvl":3,"i":2,"seen":0},{"content":"Bonus points","slug":"bonus-points","lvl":3,"i":3,"seen":0},{"content":"Compensation","slug":"compensation","lvl":3,"i":4,"seen":0},{"content":"Working with us","slug":"working-with-us","lvl":3,"i":5,"seen":0},{"content":"About Acid.info","slug":"about-acid-info","lvl":3,"i":6,"seen":0},{"content":"About Logos","slug":"about-logos","lvl":3,"i":7,"seen":0}]},"navProps":{"metadata":{"published":true,"title":"Grassroots Community Organizer"},"navOrder":-1,"localPath":"join-us/grassroots-community-organizer.md","path":["join-us","grassroots-community-organizer"],"children":[],"isDir":false},"routeParams":{"path":["join-us","grassroots-community-organizer"]}},"__N_SSG":true}